app/views/assignments/_form.html.erb

    <%= f.label :subject_id %><br>
    <%= f.collection_select :subject_id, Subject.all, :id, :name %>
---
SELECT "subjects".* FROM "subjects"

        <%= g.label :student_id %><br>
        <%= g.collection_select :student_id, Student.all, :id, :name %>
---
SELECT "students".* FROM "students"