app/views/students/index.html.erb

SELECT "grades".* FROM "grades" WHERE "grades"."student_id" = ?  [["student_id", 3]]
---
<ul>
  <% @student.grades.each do |grade|%>