app/views/students/show.html.erb

SELECT  1 AS one FROM "grades" WHERE "grades"."student_id" = ? LIMIT 1  [["student_id", 1]]
SELECT "grades".* FROM "grades" WHERE "grades"."student_id" = ?  [["student_id", 1]]
SELECT "assignments".* FROM "assignments" WHERE "assignments"."student_id" = ?  [[nil, 1]]
---
<h2> Assignments and Grades </h2>
  <% if @student.grades.any? %>
    <ul>
        <% @student.assignments.each do |a|%>