app/views/teachers/index.html.erb

    <tbody>
      <% current_user.students.each do |s| %>
        <% @parents.where(id: s.parent_id) do |p| %>
---
SELECT "students".* FROM "students" WHERE "students"."teacher_id" = ?  [["teacher_id", 1]]
SELECT  "parents".* FROM "parents" WHERE "parents"."id" = ? LIMIT 1  [["id", 3]]