app/views/teachers/show.html.erb

SELECT  1 AS one FROM "students" WHERE "students"."teacher_id" = ? LIMIT 1  [["teacher_id", 1]]
SELECT "students".* FROM "students" WHERE "students"."teacher_id" = ?  [["teacher_id", 1]]
---

<% if @teacher.students.any? %>