app/views/parents/_form.html.erb

SELECT "teachers".* FROM "teachers"
---
        <%= student.label :teacher_id %><br>
        <%= student.collection_select :teacher_id, Teacher.all, :id, :name %>