app/views/parents/index.html.erb

<ul>
  <% if @parent.students.any? %>
---
SELECT "students".* FROM "students" WHERE "students"."parent_id" = ?  [["parent_id", 3]]