app/controllers/assignments_controller.rb

INSERT INTO "assignments" ("name", "subject_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "HW 5"], ["subject_id", 4], ["created_at", "2015-02-08 00:54:46.379979"], ["updated_at", "2015-02-08 00:54:46.379979"]]
---
  def create
    @assignment = Assignment.new(assignment_params)

    respond_to do |format|
      if @assignment.save