app/controllers/grades_controller.rb

  def index
    @grades = Grade.all
---
SELECT "grades".* FROM "grades"

    def set_grade
      @grade = Grade.find(params[:id])
---
SELECT  "grades".* FROM "grades" WHERE "grades"."id" = ? LIMIT 1  [["id", 1]]