app/controllers/parents_controller.rb

SELECT  "parents".* FROM "parents" WHERE "parents"."id" = ?  ORDER BY "parents"."id" ASC LIMIT 1  [["id", 3]]
---
  def index
    @parents = Parent.all
    @parent = Parent.find(session[:parent_id])

INSERT INTO "parents" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @parent = Parent.new(parent_params)

    respond_to do |format|
      if @parent.save

SELECT  "parents".* FROM "parents" WHERE "parents"."id" = ? LIMIT 1  [["id", 4]]
---
    def set_parent
      @parent = Parent.find(params[:id])