app/controllers/sessions_controller.rb

SELECT  "teachers".* FROM "teachers" WHERE "teachers"."email" = ? LIMIT 1  [["email", "gold@rock.com"]]
SELECT  "students".* FROM "students" WHERE "students"."email" = ? LIMIT 1  [["email", "fire@wot.com"]]
SELECT  "parents".* FROM "parents" WHERE "parents"."email" = ? LIMIT 1  [["email", "student@student.com"]]
---
  def create
    if request.post?
      if t = Teacher.find_by_email(params[:email])
        if t && t.authenticate(params[:password])
          session[:teacher_id] = t.id
          redirect_to teachers_path, notice: "You've logged in."
          return
        else
          redirect_to root_path, notice: "Wrong email or password."
          return
        end
      elsif s = Student.find_by_email(params[:email])
        if s && s.authenticate(params[:password])
          session[:student_id] = s.id
          redirect_to students_path, notice: "You've logged in."
          return
        else
          redirect_to root_path, notice: "Wrong email or password."
          return
        end
      elsif p = Parent.find_by_email(params[:email])