app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ?  ORDER BY "students"."id" ASC LIMIT 1  [["id", 3]]
---
    def set_student
      @student = Student.find(params[:id])