app/controllers/teachers_controller.rb

  def create
    @teacher = Teacher.new(teacher_params)

    respond_to do |format|
      if @teacher.save
---
INSERT INTO "teachers" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

    def set_teacher
      @teacher = Teacher.find(params[:id])
---
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ?  ORDER BY "teachers"."id" ASC LIMIT 1  [["id", 1]]